Revit 2024 API
MEPNetworkIterator.CurrentElementId Property
 The element id at the current iteration step.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public ElementId CurrentElementId { get; }
Visual Basic
Public ReadOnly Property CurrentElementId As ElementId
	Get
Visual C++
public:
property ElementId^ CurrentElementId {
	ElementId^ get ();
}
See Also
MEPNetworkIterator Class
Autodesk.Revit.DB.Analysis Namespace